// Task 01. padStart
// Объявите три переменных: hour, minute, second. 
// Присвойте им следующие значения: 4, 35, 5. 
// Выведите в консоль время в формате 04:35:05.


// Task 02. repeat
// Нарисуйте в консоле пирамиду на 9 уровней как показано ниже
// 1
// 22
// 333
// 4444
// ...


// Task 03. includes
// Напишите код, который выводит в консоль true, если строка str содержит
// 'viagra' или 'XXX', а иначе false.
// Тестовые данные: 'buy ViAgRA now', 'free xxxxx'


// Task 04. includes + index
// Проверить, содержит ли строка второе вхождение подстроки, 
// вернуть true/false.


// Task 05. Template literal
// Создать строчку: "ten times two totally is 20"
// используя переменные
// const a = 10;
// const b = 2; 
// и template literal


// Task 06. normalize
// Напишите функцию, которая сравнивает юникод строки.
// Сравните две строки
// var str1 = '\u006d\u0061\u00f1';
// var str2 = '\u006d\u0061\u006e\u0303';


// Task 07. endsWIth
// Написать функцию, которая на вход получает массив имен фалов и расширение файла
// и возвращает новый массив, который содержит файлы указанного расширения.


// Task 08. String.fromCodePoint
// Написать функцию, которая выводит в консоль строчку в формате 'символ - код'
// для кодов в диапазоне 78000 - 80000


// Task 08
// Создайте функцию, которая будет рисовать в консоле следующую пирамиду
// Пример:
// pyramid(1) = '#'
// 
// pyramid(2) = ' # '
//              '###'
// 
// pyramid(3) = '  #  '
//              ' ### '
//              '#####'


// Task 09
// Создайте тег-функцию currency, которая формитирует числа до двух знаков после запятой
// и добавляет знак долара перед числом в шаблонном литерале.
